In [4]:
import pandas as pd

In [5]:
raw_data = {
         "city": ["Tripoli", "Sydney", "Tripoli", "Rome", "Rome", "Tripoli","Rome", "Sydney", "Sydney"],
         "rank": ["1st", "2nd", "1st", "2nd", "1st", "2nd","1st", "2nd", "1st"], 
         "score1": [44, 48, 39, 41, 38, 44, 34, 54, 61],
         "score2": [67, 63, 55, 70, 64, 75, 45, 66, 72]
        }
        
df = pd.DataFrame(raw_data, 
                  index = pd.Index(['A','B','C','D','E','F','G','H','I'], name='letter'),
                  columns = pd.Index(['city', 'rank','score1','score2'],name='attributes'))

In [6]:
df

attributes     city rank  score1  score2
letter
A           Tripoli  1st      44      67
B            Sydney  2nd      48      63
C           Tripoli  1st      39      55
D              Rome  2nd      41      70
E              Rome  1st      38      64
F           Tripoli  2nd      44      75
G              Rome  1st      34      45
H            Sydney  2nd      54      66
I            Sydney  1st      61      72

In [7]:
import numpy as np

In [9]:
nrows = df.shape[0]

In [10]:
b = np.random.permutation(nrows)

In [11]:
b

array([1, 3, 0, 5, 7, 6, 8, 4, 2])

In [12]:
df.take(b)

attributes     city rank  score1  score2
letter
B            Sydney  2nd      48      63
D              Rome  2nd      41      70
A           Tripoli  1st      44      67
F           Tripoli  2nd      44      75
H            Sydney  2nd      54      66
G              Rome  1st      34      45
I            Sydney  1st      61      72
E              Rome  1st      38      64
C           Tripoli  1st      39      55

In [14]:
np.random.permutation(df.index)

array(['G', 'A', 'F', 'I', 'B', 'C', 'D', 'H', 'E'], dtype=object)

In [15]:
df.reindex(np.random.permutation(df.index))

attributes     city rank  score1  score2
letter
E              Rome  1st      38      64
F           Tripoli  2nd      44      75
H            Sydney  2nd      54      66
B            Sydney  2nd      48      63
C           Tripoli  1st      39      55
A           Tripoli  1st      44      67
D              Rome  2nd      41      70
I            Sydney  1st      61      72
G              Rome  1st      34      45

In [17]:
df.sample(n=nrows)

attributes     city rank  score1  score2
letter
H            Sydney  2nd      54      66
F           Tripoli  2nd      44      75
E              Rome  1st      38      64
C           Tripoli  1st      39      55
B            Sydney  2nd      48      63
A           Tripoli  1st      44      67
G              Rome  1st      34      45
D              Rome  2nd      41      70
I            Sydney  1st      61      72

In [18]:
s = df['city']
len(s)

9

In [21]:
r_entries = np.random.permutation(len(s))

In [23]:
df

attributes     city rank  score1  score2
letter
A           Tripoli  1st      44      67
B            Sydney  2nd      48      63
C           Tripoli  1st      39      55
D              Rome  2nd      41      70
E              Rome  1st      38      64
F           Tripoli  2nd      44      75
G              Rome  1st      34      45
H            Sydney  2nd      54      66
I            Sydney  1st      61      72

In [24]:
s[n_entries].values

array(['Tripoli', 'Rome', 'Sydney', 'Rome', 'Sydney', 'Rome', 'Tripoli',
       'Tripoli', 'Sydney'], dtype=object)

In [25]:
df['city'] = s[n_entries].values

In [26]:
df

attributes     city rank  score1  score2
letter
A           Tripoli  1st      44      67
B              Rome  2nd      48      63
C            Sydney  1st      39      55
D              Rome  2nd      41      70
E            Sydney  1st      38      64
F              Rome  2nd      44      75
G           Tripoli  1st      34      45
H           Tripoli  2nd      54      66
I            Sydney  1st      61      72